# Задача 2
# Найдите сумму цифр трехзначного числа.
# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

num = input('Введите трехзначное число: ')

if len(num) == 3:
    a = int(num[0])
    b = int(num[1])
    c = int(num[2])
    sum = a + b + c

    print(f'{sum} ({a} + {b} + {c})')
else:
    print('Необходимо трехзначное число')